@Реализация

Feature: Реализация

  Scenario: Взаимодействия над чек-боксами
    * Клик на таск "АД"
    * Клик на кнопку  "Выполнено"
    * Выбор даты
    * Клик на кнопку  "Выполнено"

    * Клик на таск "Авторский надзор"
    * Клик на кнопку  "Проверка сущпола"
    * Клик на кнопку  "Проверка сущпола"

    * Клик на таск "Авторский надзор"
    * Клик на кнопку  "Выполнено"
    * Клик на кнопку  "Выполнено"

    * Клик на таск "Определить участников"
    * Клик на кнопку  "Выполнено"
    * Клик на кнопку  "Выполнено"

    * Клик на таск "Подрядчик"
    * Клик на кнопку  "Выполнено"
    * Выбор даты
    * Клик на кнопку  "Выполнено"

    * Клик на таск "Подрядчик"
    * Клик на кнопку  "Подтверждено"
    * Клик на кнопку  "Подтверждено"

    * Клик на таск "Авторский надзор" 2
    * Клик на кнопку  "Выполнено"
#    * Загрузка   файлов "ПОДД с пометками*"
    * Клик на кнопку  "Выполнено"
#
#  Scenario: Выход из системы
#    When выход из системы