@Утверждение

Feature: Утверждение

  Scenario: Взаимодействия над чек-боксами
    * Клик на таск "Определить участников"
#    Then проверка открытия формы
    * Клик на кнопку  "Выполнено"
#    Then проверка появлением галочки
    * Клик по чекбоксу "АД"
    * Клик по чекбоксу "ЦОДД"
    * Клик по чекбоксу "Информирование"
    * Ввод комментария "Проверка"
    * Клик на кнопку  "Выполнено"

    * Клик на таск "АД"
    * Клик на кнопку  "Выполнено"
    * Клик на кнопку  "Выполнено"

    * Клик на таск "Информирование"
    * Клик на кнопку  "Выполнено"
    * Клик на кнопку  "Выполнено"

    * Клик на таск "ЦОДД"
    * Клик на кнопку  "Выполнено"
    * Клик на кнопку  "Выполнено"




