@5_Завершение

Feature: Завершение работ

  Scenario: Взаимодействия со чек-боксами
    * Клик на таск "Завершение работ на проезжей части"
    * Клик на кнопку  "Выполнено"
    * Ввод "Комментарий" "Проверка"
    * Клик на кнопку  "Выполнено"

    * Клик на таск "Восстановление схемы (ЦОДД)"
    * Клик на кнопку  "Выполнено"
    * Загрузка   файлов "Акт сверки*"
    * Клик на кнопку  "Выполнено"

    * Клик на таск "Восстановление схемы (ДТ)"
    * Клик на кнопку  "Выполнено"
    * Загрузка   файлов "Документ*"
    * Клик на кнопку  "Выполнено"


